# 1. Даны два списка чисел. Найдите все числа, которые входят как в первый, так и
# во второй список и выведите их в порядке возрастания.
# Примечание. И даже эту задачу на Питоне можно решить в одну строчку.

list1 = [1, 6, 7, 6, 3, 2]
list2 = [3, 4, 5, 1, 4, 8]

print(set([i for i in list1 for i in list2 if i in list1 and i in list2]))


