# Напишите программу, которая будет преобразовывать десятичное число в двоичное (без встроенных функций).
#
# Пример:
#
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
def dectobin(n):

    b = ''

    while n > 0:
        b += str(n % 2)
        n //= 2

    print(b)


dectobin(int(input('Input num ')))