# 1.	Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму
# элементов списка, стоящих на нечётной позиции.
# Пример:
# o	[2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12



def evenindsum(liststring):

    print(sum([liststring[i] for i in range(len(liststring)) if i % 2 == 1]))


evenindsum([2, 5, 5, 5, 3, 5])