# 4. Напишите программу, которая по заданному номеру четверти, показывает
# диапазон возможных координат точек в этой четверти (x и y).

def coordrange (n):

    if n == 1:
        print('Диапазон координат: (x, y)')
    elif n == 2:
        print('Диапазон координат: (-x, y)')
    elif n == 3:
        print('Диапазон координат: (-x, -y)')
    elif n == 4:
        print('Диапазон координат: (x, -y)')


coordrange(int(input('Введите номер четверти (от 1 до 4) ')))