# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".

print(' '.join([i for i in 'Мы неабв очень любим Питон иабв Джавабв'.split(' ') if 'абв' not in i]))